app/Models/DetalleProModels.php

UPDATE `detalles_productos` SET `color` = 'blanca', `peso` = '0.05', `dimensiones` = 'XL', `accion` = 'U'
WHERE `producto_id` = '1'
---
    public function actualizarDetalle($id, $datos){

        //$this->db->table('detalles_productos')->where('producto_id', $id);
        $this->db->table('detalles_productos')->where('producto_id', $id)->update($datos);