app/Models/ProductosModels.php

    public function actualizarProducto($id, $datos){
        //$this->db->table('productos')->where('id', $id);
        $this->db->table('productos')->where('id', $id)->update($datos);
---
UPDATE `productos` SET `idCa` = '2', `nombre` = 'Camiseta', `descripcion` = 'Camiseta', `precio` = '4.99', `stock` = '20', `eliminado` = 0
WHERE `id` = '1'

    public function deleteProducto($id, $datos){
        $this->db->table('productos')->where('id', $id)->update($datos);
---
UPDATE `productos` SET `eliminado` = 1
WHERE `id` = '2'